; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l12-t1-p2---int100n150-m25---int100c150---s146---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
t0 - truck
p0 p1 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level5 level5)
(sum level0 level7 level7)
(sum level0 level8 level8)
(sum level0 level10 level10)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level5 level6)
(sum level1 level7 level8)
(sum level1 level8 level9)
(sum level1 level10 level11)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level5 level7)
(sum level2 level7 level9)
(sum level2 level8 level10)
(sum level2 level10 level12)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level5 level8)
(sum level3 level7 level10)
(sum level3 level8 level11)
(sum level3 level10 level13)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level5 level9)
(sum level4 level7 level11)
(sum level4 level8 level12)
(sum level4 level10 level14)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level5 level10)
(sum level5 level7 level12)
(sum level5 level8 level13)
(sum level5 level10 level15)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level5 level11)
(sum level6 level7 level13)
(sum level6 level8 level14)
(sum level6 level10 level16)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level5 level12)
(sum level7 level7 level14)
(sum level7 level8 level15)
(sum level7 level10 level17)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level5 level13)
(sum level8 level7 level15)
(sum level8 level8 level16)
(sum level8 level10 level18)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level5 level14)
(sum level9 level7 level16)
(sum level9 level8 level17)
(sum level9 level10 level19)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level5 level15)
(sum level10 level7 level17)
(sum level10 level8 level18)
(sum level10 level10 level20)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level5 level16)
(sum level11 level7 level18)
(sum level11 level8 level19)
(sum level11 level10 level21)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level5 level17)
(sum level12 level7 level19)
(sum level12 level8 level20)
(sum level12 level10 level22)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level5 level18)
(sum level13 level7 level20)
(sum level13 level8 level21)
(sum level13 level10 level23)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level5 level19)
(sum level14 level7 level21)
(sum level14 level8 level22)
(sum level14 level10 level24)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level5 level20)
(sum level15 level7 level22)
(sum level15 level8 level23)
(sum level15 level10 level25)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level5 level21)
(sum level16 level7 level23)
(sum level16 level8 level24)
(sum level16 level10 level26)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level5 level22)
(sum level17 level7 level24)
(sum level17 level8 level25)
(sum level17 level10 level27)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level5 level23)
(sum level18 level7 level25)
(sum level18 level8 level26)
(sum level18 level10 level28)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level5 level24)
(sum level19 level7 level26)
(sum level19 level8 level27)
(sum level19 level10 level29)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level5 level25)
(sum level20 level7 level27)
(sum level20 level8 level28)
(sum level20 level10 level30)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level5 level26)
(sum level21 level7 level28)
(sum level21 level8 level29)
(sum level21 level10 level31)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level5 level27)
(sum level22 level7 level29)
(sum level22 level8 level30)
(sum level22 level10 level32)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level18 level40)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level5 level28)
(sum level23 level7 level30)
(sum level23 level8 level31)
(sum level23 level10 level33)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level18 level41)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level5 level29)
(sum level24 level7 level31)
(sum level24 level8 level32)
(sum level24 level10 level34)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level18 level42)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level5 level30)
(sum level25 level7 level32)
(sum level25 level8 level33)
(sum level25 level10 level35)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level18 level43)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level5 level31)
(sum level26 level7 level33)
(sum level26 level8 level34)
(sum level26 level10 level36)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level18 level44)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level5 level32)
(sum level27 level7 level34)
(sum level27 level8 level35)
(sum level27 level10 level37)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level18 level45)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level5 level33)
(sum level28 level7 level35)
(sum level28 level8 level36)
(sum level28 level10 level38)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level18 level46)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level5 level34)
(sum level29 level7 level36)
(sum level29 level8 level37)
(sum level29 level10 level39)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level18 level47)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level5 level35)
(sum level30 level7 level37)
(sum level30 level8 level38)
(sum level30 level10 level40)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level18 level48)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level5 level36)
(sum level31 level7 level38)
(sum level31 level8 level39)
(sum level31 level10 level41)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level18 level49)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level5 level37)
(sum level32 level7 level39)
(sum level32 level8 level40)
(sum level32 level10 level42)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level18 level50)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level5 level38)
(sum level33 level7 level40)
(sum level33 level8 level41)
(sum level33 level10 level43)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level18 level51)
(sum level33 level19 level52)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level5 level39)
(sum level34 level7 level41)
(sum level34 level8 level42)
(sum level34 level10 level44)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level18 level52)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level5 level40)
(sum level35 level7 level42)
(sum level35 level8 level43)
(sum level35 level10 level45)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level5 level41)
(sum level36 level7 level43)
(sum level36 level8 level44)
(sum level36 level10 level46)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level5 level42)
(sum level37 level7 level44)
(sum level37 level8 level45)
(sum level37 level10 level47)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level5 level43)
(sum level38 level7 level45)
(sum level38 level8 level46)
(sum level38 level10 level48)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level5 level44)
(sum level39 level7 level46)
(sum level39 level8 level47)
(sum level39 level10 level49)
(sum level39 level13 level52)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level5 level45)
(sum level40 level7 level47)
(sum level40 level8 level48)
(sum level40 level10 level50)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level5 level46)
(sum level41 level7 level48)
(sum level41 level8 level49)
(sum level41 level10 level51)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level5 level47)
(sum level42 level7 level49)
(sum level42 level8 level50)
(sum level42 level10 level52)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level5 level48)
(sum level43 level7 level50)
(sum level43 level8 level51)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level5 level49)
(sum level44 level7 level51)
(sum level44 level8 level52)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level5 level50)
(sum level45 level7 level52)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level5 level51)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level5 level52)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level51 level1 level52)

(connected l0 l1)
(fuelcost level16 l0 l1)
(connected l0 l3)
(fuelcost level10 l0 l3)
(connected l0 l6)
(fuelcost level16 l0 l6)
(connected l0 l10)
(fuelcost level18 l0 l10)
(connected l1 l0)
(fuelcost level16 l1 l0)
(connected l1 l7)
(fuelcost level19 l1 l7)
(connected l2 l8)
(fuelcost level10 l2 l8)
(connected l3 l0)
(fuelcost level10 l3 l0)
(connected l3 l10)
(fuelcost level5 l3 l10)
(connected l4 l5)
(fuelcost level7 l4 l5)
(connected l4 l6)
(fuelcost level20 l4 l6)
(connected l4 l7)
(fuelcost level10 l4 l7)
(connected l5 l4)
(fuelcost level7 l5 l4)
(connected l5 l7)
(fuelcost level2 l5 l7)
(connected l5 l8)
(fuelcost level1 l5 l8)
(connected l5 l10)
(fuelcost level13 l5 l10)
(connected l5 l11)
(fuelcost level13 l5 l11)
(connected l6 l0)
(fuelcost level16 l6 l0)
(connected l6 l4)
(fuelcost level20 l6 l4)
(connected l6 l10)
(fuelcost level8 l6 l10)
(connected l6 l11)
(fuelcost level25 l6 l11)
(connected l7 l1)
(fuelcost level19 l7 l1)
(connected l7 l4)
(fuelcost level10 l7 l4)
(connected l7 l5)
(fuelcost level2 l7 l5)
(connected l7 l9)
(fuelcost level10 l7 l9)
(connected l7 l11)
(fuelcost level14 l7 l11)
(connected l8 l2)
(fuelcost level10 l8 l2)
(connected l8 l5)
(fuelcost level1 l8 l5)
(connected l9 l7)
(fuelcost level10 l9 l7)
(connected l10 l0)
(fuelcost level18 l10 l0)
(connected l10 l3)
(fuelcost level5 l10 l3)
(connected l10 l5)
(fuelcost level13 l10 l5)
(connected l10 l6)
(fuelcost level8 l10 l6)
(connected l11 l5)
(fuelcost level13 l11 l5)
(connected l11 l6)
(fuelcost level25 l11 l6)
(connected l11 l7)
(fuelcost level14 l11 l7)

(at t0 l6)
(fuel t0 level52)
(= (total-cost) 0)

(at p0 l6)
(at p1 l10)
)

(:goal
(and
(at p0 l8)
(at p1 l9)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l6)
   deleted: (at p0 l6)
   added: (in p0 t0)
   goals met: 0 of 2
2. (drive t0 l6 l10 level44 level8 level52)
   deleted: (at t0 l6) (fuel t0 level52)
   added: (at t0 l10) (fuel t0 level44)
   goals met: 0 of 2
3. (load p1 t0 l10)
   deleted: (at p1 l10)
   added: (in p1 t0)
   goals met: 0 of 2
4. (drive t0 l10 l5 level31 level13 level44)
   deleted: (at t0 l10) (fuel t0 level44)
   added: (at t0 l5) (fuel t0 level31)
   goals met: 0 of 2
5. (drive t0 l5 l8 level30 level1 level31)
   deleted: (at t0 l5) (fuel t0 level31)
   added: (at t0 l8) (fuel t0 level30)
   goals met: 0 of 2
6. (unload p0 t0 l8)
   deleted: (in p0 t0)
   added: (at p0 l8)
   goals met: 1 of 2
7. (drive t0 l8 l5 level29 level1 level30)
   deleted: (at t0 l8) (fuel t0 level30)
   added: (at t0 l5) (fuel t0 level29)
   goals met: 1 of 2
8. (drive t0 l5 l7 level27 level2 level29)
   deleted: (at t0 l5) (fuel t0 level29)
   added: (at t0 l7) (fuel t0 level27)
   goals met: 1 of 2
9. (drive t0 l7 l9 level17 level10 level27)
   deleted: (at t0 l7) (fuel t0 level27)
   added: (at t0 l9) (fuel t0 level17)
   goals met: 1 of 2
10. (unload p1 t0 l9)
   deleted: (in p1 t0)
   added: (at p1 l9)
   goals met: 2 of 2
